DO
$$
    BEGIN
        BEGIN
            CREATE TYPE public.VOICE AS ENUM ('Тенор', 'Баритон', 'Бас', 'Контральто', 'Сопрано', 'Альт', 'Меццо-сопрано', 'Контртенор', 'Драматический тенор', 'Лирический тенор', 'Драматический баритон', 'Лирический баритон', 'Драматический бас', 'Легкий баритон', 'Лирический бас', 'Фальцет', 'Драматический контртенор', 'Лирический контртенор');
        EXCEPTION
            WHEN duplicate_object THEN
                RAISE NOTICE 'Type already exists, skipping creation.';
        END;
    END
$$;